// 34个省市坐标
var geoCoordMap = {
    "北京": [116.4074, 39.9042],
    "天津": [117.2000, 39.1333],
    "上海": [121.4737, 31.2304],
    "重庆": [106.5505, 29.5638],
    "河北": [114.5300, 38.0371],
    "山西": [112.5492, 37.8570],
    "辽宁": [123.4291, 41.7968],
    "吉林": [125.3245, 43.8868],
    "黑龙江": [126.6425, 45.7560],
    "江苏": [118.7674, 32.0415],
    "浙江": [120.1536, 30.2655],
    "安徽": [117.2830, 31.8612],
    "福建": [119.3062, 26.0753],
    "江西": [115.8922, 28.6765],
    "山东": [117.0009, 36.6758],
    "河南": [113.6654, 34.7570],
    "湖北": [114.2986, 30.5844],
    "湖南": [112.9388, 28.2282],
    "广东": [113.2644, 23.1291],
    "广西": [108.3200, 22.8240],
    "海南": [110.3312, 20.0319],
    "四川": [104.0665, 30.5728],
    "贵州": [106.7135, 26.5783],
    "云南": [102.7123, 25.0406],
    "陕西": [108.9542, 34.2655],
    "甘肃": [103.8343, 36.0611],
    "青海": [101.7782, 36.6171],
    "西藏": [91.1322, 29.6604],
    "内蒙古": [111.6708, 40.8183],
    "宁夏": [106.2782, 38.4664],
    "新疆": [87.6177, 43.7928],
    "香港": [114.1733, 22.3200],
    "澳门": [113.5439, 22.1987],
    "台湾": [121.5091, 25.0443]
};


var moveData = [
    {
        "from": "北京",
        "to": "北京",
        "value": 1947287
    },
    {
        "from": "北京",
        "to": "四川",
        "value": 4275474
    },
    {
        "from": "北京",
        "to": "江苏",
        "value": 3895769
    },
    {
        "from": "北京",
        "to": "江西",
        "value": 234450
    },
    {
        "from": "北京",
        "to": "河北",
        "value": 481449
    },
    {
        "from": "北京",
        "to": "广西",
        "value": 2852904
    },
    {
        "from": "北京",
        "to": "黑龙江",
        "value": 2462531
    },
    {
        "from": "北京",
        "to": "上海",
        "value": 1223969
    },
    {
        "from": "北京",
        "to": "青海",
        "value": 517074
    },
    {
        "from": "北京",
        "to": "内蒙古",
        "value": 1589291
    },
    {
        "from": "北京",
        "to": "陕西",
        "value": 3786947
    },
    {
        "from": "北京",
        "to": "贵州",
        "value": 428887
    },
    {
        "from": "北京",
        "to": "山东",
        "value": 2755526
    },
    {
        "from": "北京",
        "to": "云南",
        "value": 22959
    },
    {
        "from": "北京",
        "to": "广东",
        "value": 2052910
    },
    {
        "from": "北京",
        "to": "河南",
        "value": 3162383
    },
    {
        "from": "北京",
        "to": "海南",
        "value": 310545
    },
    {
        "from": "北京",
        "to": "天津",
        "value": 1635495
    },
    {
        "from": "北京",
        "to": "甘肃",
        "value": 4285673
    },
    {
        "from": "北京",
        "to": "吉林",
        "value": 3369955
    },
    {
        "from": "北京",
        "to": "宁夏",
        "value": 3496513
    },
    {
        "from": "北京",
        "to": "西藏",
        "value": 2688935
    },
    {
        "from": "北京",
        "to": "重庆",
        "value": 1579716
    },
    {
        "from": "北京",
        "to": "山西",
        "value": 489702
    },
    {
        "from": "北京",
        "to": "新疆",
        "value": 1071536
    },
    {
        "from": "北京",
        "to": "澳门",
        "value": 530805
    },
    {
        "from": "北京",
        "to": "湖北",
        "value": 3421625
    },
    {
        "from": "北京",
        "to": "浙江",
        "value": 2623925
    },
    {
        "from": "北京",
        "to": "安徽",
        "value": 625727
    },
    {
        "from": "北京",
        "to": "福建",
        "value": 1048884
    },
    {
        "from": "北京",
        "to": "香港",
        "value": 1919790
    },
    {
        "from": "北京",
        "to": "湖南",
        "value": 1656268
    },
    {
        "from": "北京",
        "to": "辽宁",
        "value": 2377000
    },
    {
        "from": "北京",
        "to": "台湾",
        "value": 2014196
    },
    {
        "from": "上海",
        "to": "上海",
        "value": 31382037
    },
    {
        "from": "上海",
        "to": "福建",
        "value": 4256609
    },
    {
        "from": "上海",
        "to": "海南",
        "value": 534649
    },
    {
        "from": "上海",
        "to": "甘肃",
        "value": 976729
    },
    {
        "from": "上海",
        "to": "青海",
        "value": 1357100
    },
    {
        "from": "上海",
        "to": "河北",
        "value": 4265775
    },
    {
        "from": "上海",
        "to": "江苏",
        "value": 2548421
    },
    {
        "from": "上海",
        "to": "吉林",
        "value": 4085739
    },
    {
        "from": "上海",
        "to": "湖南",
        "value": 3647816
    },
    {
        "from": "上海",
        "to": "安徽",
        "value": 4039741
    },
    {
        "from": "上海",
        "to": "西藏",
        "value": 869591
    },
    {
        "from": "上海",
        "to": "山东",
        "value": 3798595
    },
    {
        "from": "上海",
        "to": "广东",
        "value": 1581036
    },
    {
        "from": "上海",
        "to": "黑龙江",
        "value": 4393052
    },
    {
        "from": "上海",
        "to": "云南",
        "value": 2935265
    },
    {
        "from": "上海",
        "to": "宁夏",
        "value": 1637467
    },
    {
        "from": "上海",
        "to": "天津",
        "value": 3698572
    },
    {
        "from": "上海",
        "to": "广西",
        "value": 3355270
    },
    {
        "from": "上海",
        "to": "内蒙古",
        "value": 2819725
    },
    {
        "from": "上海",
        "to": "北京",
        "value": 3170789
    },
    {
        "from": "上海",
        "to": "湖北",
        "value": 462189
    },
    {
        "from": "上海",
        "to": "四川",
        "value": 2812961
    },
    {
        "from": "上海",
        "to": "重庆",
        "value": 1199328
    },
    {
        "from": "上海",
        "to": "江西",
        "value": 2117031
    },
    {
        "from": "上海",
        "to": "河南",
        "value": 1257487
    },
    {
        "from": "上海",
        "to": "陕西",
        "value": 704249
    },
    {
        "from": "上海",
        "to": "台湾",
        "value": 658589
    },
    {
        "from": "上海",
        "to": "澳门",
        "value": 4402979
    },
    {
        "from": "上海",
        "to": "辽宁",
        "value": 1432279
    },
    {
        "from": "上海",
        "to": "香港",
        "value": 4105015
    },
    {
        "from": "上海",
        "to": "山西",
        "value": 4665745
    },
    {
        "from": "上海",
        "to": "贵州",
        "value": 1128807
    },
    {
        "from": "上海",
        "to": "浙江",
        "value": 1961762
    },
    {
        "from": "上海",
        "to": "新疆",
        "value": 1296027
    },
    {
        "from": "广东",
        "to": "广东",
        "value": 75325324
    },
    {
        "from": "广东",
        "to": "福建",
        "value": 4221816
    },
    {
        "from": "广东",
        "to": "台湾",
        "value": 3088263
    },
    {
        "from": "广东",
        "to": "甘肃",
        "value": 2804053
    },
    {
        "from": "广东",
        "to": "新疆",
        "value": 4319989
    },
    {
        "from": "广东",
        "to": "澳门",
        "value": 1681634
    },
    {
        "from": "广东",
        "to": "宁夏",
        "value": 4163520
    },
    {
        "from": "广东",
        "to": "辽宁",
        "value": 4206673
    },
    {
        "from": "广东",
        "to": "内蒙古",
        "value": 43189
    },
    {
        "from": "广东",
        "to": "陕西",
        "value": 4433796
    },
    {
        "from": "广东",
        "to": "天津",
        "value": 82768
    },
    {
        "from": "广东",
        "to": "北京",
        "value": 2903244
    },
    {
        "from": "广东",
        "to": "贵州",
        "value": 4418097
    },
    {
        "from": "广东",
        "to": "青海",
        "value": 81032
    },
    {
        "from": "广东",
        "to": "浙江",
        "value": 4224270
    },
    {
        "from": "广东",
        "to": "江苏",
        "value": 4900685
    },
    {
        "from": "广东",
        "to": "吉林",
        "value": 3704125
    },
    {
        "from": "广东",
        "to": "云南",
        "value": 2878605
    },
    {
        "from": "广东",
        "to": "重庆",
        "value": 569464
    },
    {
        "from": "广东",
        "to": "河南",
        "value": 2388842
    },
    {
        "from": "广东",
        "to": "上海",
        "value": 23159
    },
    {
        "from": "广东",
        "to": "山东",
        "value": 1115629
    },
    {
        "from": "广东",
        "to": "香港",
        "value": 4596863
    },
    {
        "from": "广东",
        "to": "广西",
        "value": 4159773
    },
    {
        "from": "广东",
        "to": "湖南",
        "value": 3709923
    },
    {
        "from": "广东",
        "to": "安徽",
        "value": 2826823
    },
    {
        "from": "广东",
        "to": "黑龙江",
        "value": 4238145
    },
    {
        "from": "广东",
        "to": "河北",
        "value": 4390970
    },
    {
        "from": "广东",
        "to": "海南",
        "value": 3174738
    },
    {
        "from": "广东",
        "to": "四川",
        "value": 4741166
    },
    {
        "from": "广东",
        "to": "江西",
        "value": 2874627
    },
    {
        "from": "广东",
        "to": "西藏",
        "value": 3185627
    },
    {
        "from": "广东",
        "to": "湖北",
        "value": 1434663
    },
    {
        "from": "广东",
        "to": "山西",
        "value": 2354957
    },
    {
        "from": "江苏",
        "to": "江苏",
        "value": 126524563
    },
    {
        "from": "江苏",
        "to": "内蒙古",
        "value": 3689101
    },
    {
        "from": "江苏",
        "to": "山东",
        "value": 3961272
    },
    {
        "from": "江苏",
        "to": "云南",
        "value": 3640614
    },
    {
        "from": "江苏",
        "to": "青海",
        "value": 4390593
    },
    {
        "from": "江苏",
        "to": "江西",
        "value": 4790678
    },
    {
        "from": "江苏",
        "to": "台湾",
        "value": 4316976
    },
    {
        "from": "江苏",
        "to": "海南",
        "value": 4355088
    },
    {
        "from": "江苏",
        "to": "山西",
        "value": 1572977
    },
    {
        "from": "江苏",
        "to": "甘肃",
        "value": 2662198
    },
    {
        "from": "江苏",
        "to": "天津",
        "value": 1384992
    },
    {
        "from": "江苏",
        "to": "湖南",
        "value": 1645128
    },
    {
        "from": "江苏",
        "to": "浙江",
        "value": 3006049
    },
    {
        "from": "江苏",
        "to": "福建",
        "value": 3624633
    },
    {
        "from": "江苏",
        "to": "河南",
        "value": 2142989
    },
    {
        "from": "江苏",
        "to": "北京",
        "value": 1025057
    },
    {
        "from": "江苏",
        "to": "辽宁",
        "value": 3199753
    },
    {
        "from": "江苏",
        "to": "宁夏",
        "value": 4129349
    },
    {
        "from": "江苏",
        "to": "四川",
        "value": 2256879
    },
    {
        "from": "江苏",
        "to": "上海",
        "value": 3660627
    },
    {
        "from": "江苏",
        "to": "重庆",
        "value": 2365970
    },
    {
        "from": "江苏",
        "to": "新疆",
        "value": 2592552
    },
    {
        "from": "江苏",
        "to": "广西",
        "value": 2654742
    },
    {
        "from": "江苏",
        "to": "广东",
        "value": 1801379
    },
    {
        "from": "江苏",
        "to": "黑龙江",
        "value": 4453716
    },
    {
        "from": "江苏",
        "to": "河北",
        "value": 1947200
    },
    {
        "from": "江苏",
        "to": "陕西",
        "value": 725563
    },
    {
        "from": "江苏",
        "to": "西藏",
        "value": 2852222
    },
    {
        "from": "江苏",
        "to": "贵州",
        "value": 2788211
    },
    {
        "from": "江苏",
        "to": "吉林",
        "value": 2017406
    },
    {
        "from": "江苏",
        "to": "澳门",
        "value": 2214911
    },
    {
        "from": "江苏",
        "to": "湖北",
        "value": 1696977
    },
    {
        "from": "江苏",
        "to": "安徽",
        "value": 4909386
    },
    {
        "from": "江苏",
        "to": "香港",
        "value": 3147398
    },
    {
        "from": "福建",
        "to": "福建",
        "value": 13420748
    },
    {
        "from": "福建",
        "to": "台湾",
        "value": 420748
    },
    {
        "from": "福建",
        "to": "重庆",
        "value": 4734695
    },
    {
        "from": "福建",
        "to": "香港",
        "value": 798569
    },
    {
        "from": "福建",
        "to": "山东",
        "value": 1507304
    },
    {
        "from": "福建",
        "to": "河南",
        "value": 3562309
    },
    {
        "from": "福建",
        "to": "宁夏",
        "value": 1404107
    },
    {
        "from": "福建",
        "to": "西藏",
        "value": 1973682
    },
    {
        "from": "福建",
        "to": "辽宁",
        "value": 3405542
    },
    {
        "from": "福建",
        "to": "安徽",
        "value": 338931
    },
    {
        "from": "福建",
        "to": "四川",
        "value": 4824140
    },
    {
        "from": "福建",
        "to": "河北",
        "value": 748573
    },
    {
        "from": "福建",
        "to": "北京",
        "value": 1182699
    },
    {
        "from": "福建",
        "to": "天津",
        "value": 2659966
    },
    {
        "from": "福建",
        "to": "江西",
        "value": 637624
    },
    {
        "from": "福建",
        "to": "海南",
        "value": 1379452
    },
    {
        "from": "福建",
        "to": "云南",
        "value": 2901359
    },
    {
        "from": "福建",
        "to": "上海",
        "value": 2719034
    },
    {
        "from": "福建",
        "to": "青海",
        "value": 4023893
    },
    {
        "from": "福建",
        "to": "贵州",
        "value": 3592240
    },
    {
        "from": "福建",
        "to": "江苏",
        "value": 3764811
    },
    {
        "from": "福建",
        "to": "山西",
        "value": 4602447
    },
    {
        "from": "福建",
        "to": "陕西",
        "value": 1429784
    },
    {
        "from": "福建",
        "to": "甘肃",
        "value": 3921716
    },
    {
        "from": "福建",
        "to": "澳门",
        "value": 167670
    },
    {
        "from": "福建",
        "to": "广西",
        "value": 770312
    },
    {
        "from": "福建",
        "to": "浙江",
        "value": 3788370
    },
    {
        "from": "福建",
        "to": "广东",
        "value": 1753964
    },
    {
        "from": "福建",
        "to": "吉林",
        "value": 2447135
    },
    {
        "from": "福建",
        "to": "湖南",
        "value": 1115063
    },
    {
        "from": "福建",
        "to": "湖北",
        "value": 1808228
    },
    {
        "from": "福建",
        "to": "内蒙古",
        "value": 4029304
    },
    {
        "from": "福建",
        "to": "黑龙江",
        "value": 3844735
    },
    {
        "from": "福建",
        "to": "新疆",
        "value": 481378
    },
    {
        "from": "内蒙古",
        "to": "内蒙古",
        "value": 1324643
    },
    {
        "from": "内蒙古",
        "to": "安徽",
        "value": 2468010
    },
    {
        "from": "内蒙古",
        "to": "海南",
        "value": 2606614
    },
    {
        "from": "内蒙古",
        "to": "北京",
        "value": 1877898
    },
    {
        "from": "内蒙古",
        "to": "四川",
        "value": 4986957
    },
    {
        "from": "内蒙古",
        "to": "吉林",
        "value": 2057636
    },
    {
        "from": "内蒙古",
        "to": "浙江",
        "value": 2393276
    },
    {
        "from": "内蒙古",
        "to": "江苏",
        "value": 1130853
    },
    {
        "from": "内蒙古",
        "to": "山东",
        "value": 3586023
    },
    {
        "from": "内蒙古",
        "to": "澳门",
        "value": 4288944
    },
    {
        "from": "内蒙古",
        "to": "宁夏",
        "value": 3652177
    },
    {
        "from": "内蒙古",
        "to": "河北",
        "value": 2276886
    },
    {
        "from": "内蒙古",
        "to": "新疆",
        "value": 169187
    },
    {
        "from": "内蒙古",
        "to": "辽宁",
        "value": 770614
    },
    {
        "from": "内蒙古",
        "to": "湖南",
        "value": 4641421
    },
    {
        "from": "内蒙古",
        "to": "河南",
        "value": 86683
    },
    {
        "from": "内蒙古",
        "to": "贵州",
        "value": 544714
    },
    {
        "from": "内蒙古",
        "to": "广东",
        "value": 4135147
    },
    {
        "from": "内蒙古",
        "to": "台湾",
        "value": 3125239
    },
    {
        "from": "内蒙古",
        "to": "山西",
        "value": 1642077
    },
    {
        "from": "内蒙古",
        "to": "广西",
        "value": 3518911
    },
    {
        "from": "内蒙古",
        "to": "重庆",
        "value": 701742
    },
    {
        "from": "内蒙古",
        "to": "陕西",
        "value": 1089623
    },
    {
        "from": "内蒙古",
        "to": "西藏",
        "value": 3219305
    },
    {
        "from": "内蒙古",
        "to": "黑龙江",
        "value": 2927775
    },
    {
        "from": "内蒙古",
        "to": "上海",
        "value": 2108960
    },
    {
        "from": "内蒙古",
        "to": "青海",
        "value": 1367098
    },
    {
        "from": "内蒙古",
        "to": "福建",
        "value": 1209629
    },
    {
        "from": "内蒙古",
        "to": "香港",
        "value": 3894431
    },
    {
        "from": "内蒙古",
        "to": "天津",
        "value": 467912
    },
    {
        "from": "内蒙古",
        "to": "甘肃",
        "value": 2383458
    },
    {
        "from": "内蒙古",
        "to": "江西",
        "value": 2732032
    },
    {
        "from": "内蒙古",
        "to": "湖北",
        "value": 4790932
    },
    {
        "from": "内蒙古",
        "to": "云南",
        "value": 632710
    },
    {
        "from": "重庆",
        "to": "重庆",
        "value": 643574
    },
    {
        "from": "重庆",
        "to": "贵州",
        "value": 4303226
    },
    {
        "from": "重庆",
        "to": "江苏",
        "value": 4198914
    },
    {
        "from": "重庆",
        "to": "上海",
        "value": 4607634
    },
    {
        "from": "重庆",
        "to": "河南",
        "value": 1098345
    },
    {
        "from": "重庆",
        "to": "福建",
        "value": 753212
    },
    {
        "from": "重庆",
        "to": "海南",
        "value": 4482790
    },
    {
        "from": "重庆",
        "to": "湖北",
        "value": 1944534
    },
    {
        "from": "重庆",
        "to": "新疆",
        "value": 709497
    },
    {
        "from": "重庆",
        "to": "宁夏",
        "value": 2390515
    },
    {
        "from": "重庆",
        "to": "北京",
        "value": 1331366
    },
    {
        "from": "重庆",
        "to": "西藏",
        "value": 4835919
    },
    {
        "from": "重庆",
        "to": "浙江",
        "value": 2323951
    },
    {
        "from": "重庆",
        "to": "天津",
        "value": 2338150
    },
    {
        "from": "重庆",
        "to": "青海",
        "value": 3298689
    },
    {
        "from": "重庆",
        "to": "台湾",
        "value": 3153859
    },
    {
        "from": "重庆",
        "to": "河北",
        "value": 833581
    },
    {
        "from": "重庆",
        "to": "内蒙古",
        "value": 3323995
    },
    {
        "from": "重庆",
        "to": "吉林",
        "value": 123203
    },
    {
        "from": "重庆",
        "to": "湖南",
        "value": 1976081
    },
    {
        "from": "重庆",
        "to": "香港",
        "value": 4236370
    },
    {
        "from": "重庆",
        "to": "甘肃",
        "value": 3273214
    },
    {
        "from": "重庆",
        "to": "辽宁",
        "value": 1694689
    },
    {
        "from": "重庆",
        "to": "云南",
        "value": 3526468
    },
    {
        "from": "重庆",
        "to": "广西",
        "value": 2151707
    },
    {
        "from": "重庆",
        "to": "山西",
        "value": 3372559
    },
    {
        "from": "重庆",
        "to": "安徽",
        "value": 180493
    },
    {
        "from": "重庆",
        "to": "广东",
        "value": 2879494
    },
    {
        "from": "重庆",
        "to": "山东",
        "value": 4735660
    },
    {
        "from": "重庆",
        "to": "澳门",
        "value": 2148366
    },
    {
        "from": "重庆",
        "to": "陕西",
        "value": 640115
    },
    {
        "from": "重庆",
        "to": "黑龙江",
        "value": 3890883
    },
    {
        "from": "重庆",
        "to": "四川",
        "value": 3323676
    },
    {
        "from": "重庆",
        "to": "江西",
        "value": 4559797
    },
    {
        "from": "天津",
        "to": "天津",
        "value": 674235
    },
    {
        "from": "天津",
        "to": "浙江",
        "value": 1347981
    },
    {
        "from": "天津",
        "to": "山东",
        "value": 323314
    },
    {
        "from": "天津",
        "to": "内蒙古",
        "value": 244440
    },
    {
        "from": "天津",
        "to": "澳门",
        "value": 4144304
    },
    {
        "from": "天津",
        "to": "上海",
        "value": 369530
    },
    {
        "from": "天津",
        "to": "陕西",
        "value": 4202205
    },
    {
        "from": "天津",
        "to": "黑龙江",
        "value": 761149
    },
    {
        "from": "天津",
        "to": "北京",
        "value": 487908
    },
    {
        "from": "天津",
        "to": "吉林",
        "value": 4721446
    },
    {
        "from": "天津",
        "to": "四川",
        "value": 2617441
    },
    {
        "from": "天津",
        "to": "辽宁",
        "value": 1188559
    },
    {
        "from": "天津",
        "to": "甘肃",
        "value": 1510467
    },
    {
        "from": "天津",
        "to": "安徽",
        "value": 1987466
    },
    {
        "from": "天津",
        "to": "台湾",
        "value": 3044232
    },
    {
        "from": "天津",
        "to": "宁夏",
        "value": 1237180
    },
    {
        "from": "天津",
        "to": "重庆",
        "value": 2582256
    },
    {
        "from": "天津",
        "to": "湖南",
        "value": 460701
    },
    {
        "from": "天津",
        "to": "青海",
        "value": 545719
    },
    {
        "from": "天津",
        "to": "江苏",
        "value": 4477701
    },
    {
        "from": "天津",
        "to": "福建",
        "value": 1301279
    },
    {
        "from": "天津",
        "to": "海南",
        "value": 1788467
    },
    {
        "from": "天津",
        "to": "香港",
        "value": 4266762
    },
    {
        "from": "天津",
        "to": "湖北",
        "value": 2474568
    },
    {
        "from": "天津",
        "to": "河南",
        "value": 793679
    },
    {
        "from": "天津",
        "to": "云南",
        "value": 1969494
    },
    {
        "from": "天津",
        "to": "贵州",
        "value": 2000045
    },
    {
        "from": "天津",
        "to": "新疆",
        "value": 1398246
    },
    {
        "from": "天津",
        "to": "山西",
        "value": 1147820
    },
    {
        "from": "天津",
        "to": "广东",
        "value": 960241
    },
    {
        "from": "天津",
        "to": "河北",
        "value": 1062832
    },
    {
        "from": "天津",
        "to": "江西",
        "value": 976129
    },
    {
        "from": "天津",
        "to": "西藏",
        "value": 3640678
    },
    {
        "from": "天津",
        "to": "广西",
        "value": 29047
    }
];
