CREATE TABLE move_data (
    id SERIAL PRIMARY KEY,
    from_city VARCHAR(50),
    to_city   VARCHAR(50),
    value     INT
);

INSERT INTO move_data (from_city, to_city, value) VALUES
('北京', '北京', 1947287),
('北京', '四川', 4275474),
('北京', '江苏', 3895769),
('北京', '江西', 234450),
('北京', '河北', 481449),
('北京', '广西', 2852904),
('北京', '黑龙江', 2462531),
('北京', '上海', 1223969),
('北京', '青海', 517074),
('北京', '内蒙古', 1589291),
('上海', '上海', 1223969),
('上海', '北京', 1947287),
('上海', '四川', 4275474),
('上海', '江苏', 3895769),
('上海', '江西', 234450),
('上海', '河北', 481449),
('上海', '广西', 2852904),
('上海', '黑龙江', 2462531),
('上海', '青海', 517074),
('上海', '内蒙古', 1589291),
('广东', '四川', 150000),
('新疆', '北京', 2500000),
('浙江', '山东', 50000),
('河南', '江苏', 15000000);
